# [1,2,3,4,5], 2 ----> [3,4,5,1,2]
# num - колличество попов рэнж
# при нам(-) работает как нам(+)
# при кол-ве большем чем список брать остачу при делении
# def restruct(a_list, num):
#
#     if num > 0:
#         for i in range(0, num):
#             a_num = a_list.pop(0)
#             a_list.append(a_num)
#
#         return a_list
#     if num < 0:
#        num_minus = num + num * 2
#         for i in range(0, num_minus):
#             a_num = a_list.pop(0)
#             a_list.append(a_num)
#
#         return a_list
#
#
#
#
#
# print(restruct([1,2,3,4,5], 2))


#=================================================
# асинхронный питон
#gil посмотреть
#ДЗ - Контейнер, содержит список списков, вернуть их сумму
#ДЗ - Есть файл в котором записаны строками инфаормация о пользователе, каждая строка это один пользователь
# имя, фамилия, год рождени и номер телефона, нужно реализовать метод(функцию) который принимает диапазон годов
# по окончанию работы создается новый файл в котором люди которые родились в этом диапазоне
#ДЗ - Реализовать игру "Морской бой" (матрица), пользователь вводит координаты
#ДЗ - Сделать все что не успел